## Pandas intro from the web.

In [1]:
import pandas as pd

### DataFrame
- When using a Python dictionary of lists, the keys will be used as column headers and the values in each list as columns as columns of the DataFrame.
- 2D data structure that can store data of different types, including characters, integers, floats, categorical data and more.

In [4]:
df = pd.DataFrame(
    {
        "Name": [
            "Badzioch, Mr. Andrew",
            "Skywalker, Mr. Luke",
            "Organa, Princess Leia",

        ],
        "Age": [44, 36, 36],
        "Sex": ["male", "male", "female"],
    }
)

In [5]:
df

                    Name  Age     Sex
0   Badzioch, Mr. Andrew   44    male
1    Skywalker, Mr. Luke   36    male
2  Organa, Princess Leia   36  female

In [7]:
# Each column of a DataFrame is a Series.
# Use square brackets [] to select.
df["Age"]

0    44
1    36
2    36
Name: Age, dtype: int64

In [8]:
# You can create a Series from scratch
df["Homeworld"] = ["Earth", "Tatooine", "Alderaan"]
df

                    Name  Age     Sex Homeworld
0   Badzioch, Mr. Andrew   44    male     Earth
1    Skywalker, Mr. Luke   36    male  Tatooine
2  Organa, Princess Leia   36  female  Alderaan

In [9]:
df.describe()

             Age
count   3.000000
mean   38.666667
std     4.618802
min    36.000000
25%    36.000000
50%    36.000000
75%    40.000000
max    44.000000